classdef cona
%- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
%Плотность металлов p (при 20°C):
%              кг/м3
%Алюминий	2.6889*10^3
%Вольфрам	19.35*10^3
%Железо     7.874*10^3
%Золото     19.32*10^3
%Кобальт	8.90*10^3
%Литий      0.534*10^3
%Медь       8.96*10^3
%- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
%Температуропроводность
%              м?/с
%алюминий	0,00008418
%медь		0,00011234
%золото		0,00012839
%железо		0,00002631
%свинец		0,00002395
%вольфрам	0,00006672
%литий		0,00004433
%- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
%Теплоёмкость еденицы массы
%          кДж/кг*К
%алюминий	0,930
%медь		0,385
%золото		0,129
%железо		0,444
%свинец		0,130
%вольфрам	0,134
%литий		3,582
%- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
    properties
    end
    
    methods
    end
    
end

