function [U,Y]=candn(c1,c2,c,n,m) 
%% "Метод Кранка - Николсона"
% - c1=u(0,t) и c2=u(a,t) 
% - а и b - правые точки интервалов [0,а] и [0,b] 
% - с - постоянная уравнения теплопроводности 
% - n и m - число точек решетки на интервалах [0,а] и [0,b] 
%% Инициализация параметров и матрицы U 
global k 
%h=a/(n-1);
h=1;
%k=b/(m-1);
r=c^2*k/h^2;
s1=2+2/r; 
s2=2/r-2; 
U=zeros(n,m); 
%% Граничные условия
U(1,1:m)=c1; 
U(n,1:m)=c2; 
%% Генерирование первого ряда
U(2:n-1,1)=Uo(h:h:(n-2)*h)'; 
%% Формирование диагональных и не лежащих на диагонали 
%Формирование диагональных и не лежащих на диагонали 
%элементов А, вектора постоянных В ' 
%и решение трехдиагональной системы АХ=В
Vb=zeros();
Y=zeros();
Vd(1,1:n)=s1*ones(1,n); 
Vd(1)=1; 
Vd(n)=1; 
Va=-ones(1,n-1); 
Va(n-1)=0; 
Vc=-ones(1,n-1); 
Vc(1)=0; 
Vb(1)=c1; 
Vb(n)=c2; 
    for j=2:m 
         for i=2:n-1
             Vb(i)=U(i-1,j-1)+U(i+1,j-1)+s2*U(i,j-1);
         end
    X=progon(Va,Vd,Vc,Vb); 
    U(1:n,j)=X';
    end 
U=U';
%% Точное решение и определение погрешности
x=0:h:h*(n-1);
t=0:k:k*(m-1);
    for i=1:1:n
        for j=1:1:m
        Y(i,j)=U1(x(i),t(j));
        end
    end
Y=Y';
pogr=(abs(Y-U));
max(max(pogr))
%% Посторение графика
xlabel('X');
ylabel('t');
zlabel('U(x,t)');
subplot(1,2,1),pcolor(U)
colorbar;
view(0,90)

U(:,2)=[];
U(:,end-1)=[];

subplot(1,2,2),surf(U)
shading interp;
material METAL;
view(0,0)

axis([0 n 0 m 0 max(max(U))]);
